{"chapters":[],"id":10,"path":"i-was-caught-up-in-a-hero-summoning-but-that-world-is-at-peace","pluginId":"novelupdates","name":"I Was Caught up in a Hero Summoning, but That World Is at Peace (WN)","cover":"https://cdn.novelupdates.com/images/2018/01/isekai-at-peace.jpg","summary":"It all happened so abruptly. After finally grasping my situation, I found myself in an entirely different world. Looking around, I noticed others in the same predicament… Could this possibly be one of those Hero developments?\nWas there a tyrannical Demon Lord needing extermination, or would I be tossed into the maelstrom of war? Whatever it was, I was afraid. I never wanted to be a Hero. I don’t want to harm another…… Ignore the nonsense I was spouting; there was nothing to fret over.\nThe Demon Lord was slain a thousand years ago, and 800 years had passed since the last war. The nobles didn’t treat us summoned like tr*sh; instead, we were kindly cared for. The Demons have been on good terms with Humans for some time now. Dangers, such as monsters, were being taken care of by the Guild and the Order of Knights. What’s more surprising is the fact that I wasn’t even a hero! Instead, I was unintentionally summoned!\nIt also turns out that this world was a world in which the three races, the Spirit World’s Magical Races, the Celestial World’s Divine Races, and the Mortal World’s Human Races, are kind neighbours. Here, everyone lives a peaceful and fulfilling life.\nIn summary, this other world was――at peace.\nWhat’s my plan for the future? For my limited stay here, I will live this world to its fullest; going on a cultural exchange, sightseeing, then, after experiencing the festival that is only held once every ten years, …… I shall safely return home.\nHowever, despite my lust for a peaceful last year before returning, this planet’s heavyweights have begun amassing around me, and……\n\nType: Web Novel (JP)","author":"Toudai灯台","artist":"","status":"Ongoing","genres":"Comedy,Fantasy,Harem,Romance,Shounen,Slice,of,Life","inLibrary":1,"isLocal":0,"totalPages":0,"chaptersDownloaded":0,"chaptersUnread":0,"totalChapters":0,"lastReadAt":null,"lastUpdatedAt":null}