{"chapters":[],"id":61,"path":"the-harem-teacher-at-elreis-sorceress-academy","pluginId":"novelupdates","name":"The Harem Teacher at Elreis Sorceress Academy","cover":"https://cdn.novelupdates.com/images/2020/11/A-Cover-1.jpg","summary":"～Can He Build a Harem in the School without Getting Caught?～\nTheophil Krause is a young court wizard and undoubtedly one of the most elites in the country.\nHe is loyal to his duties, but there is one thing he is even more passionate about – its his ambition to corrupt highborn women of his choice and build a harem for himself.\nFor that, the Elreis Magical Girls Academy is a suitable hunting ground. It is a garden of prideful women, but only the ladies of famous high-class families were able to attend there, and of course, where all boys were forbidden from entering.\nIt is to the extent that even the most bottom personnel are thoroughly selected and sieved for their abilities so that there won’t be a need for a single male in the school, but after corrupting the headmaster, Julia, into something that can’t live on without his member, he succeeded in infiltrating the school as their first male magic teacher.\nAs he is also a court wizard with a good reputation, he was well received by the noble ladies in the class. But even with all that adoration, he only plans to aim at the best of the best.\nHe entices several women in the academy; the students, the student council president, and the school’s teachers, and even the school nurse, achieving the ultimate pleasure by corrupting the innocence that these haughty women protect the most.\nHowever, it is not without risks, as the more his women grew, the more the attention he gains from the powerful chancellor, which is also the founder of the school.\nWill Theophil succeed in making his dream harem? Or will he fail and lose everything before he makes it to the top?\nMaking use of his body manipulation magic and mind-reading techniques, plus his wits as an excellent court wizard, Theophil’s plan to get the best girls for his harem as he outwits the chancellor has already begun!\n\nType: Web Novel (JP)","author":"Narita Harem King成田ハーレム王","artist":"","status":"Completed","genres":"Adult,Ecchi,Fantasy,Harem","inLibrary":1,"isLocal":0,"totalPages":0,"chaptersDownloaded":0,"chaptersUnread":0,"totalChapters":0,"lastReadAt":null,"lastUpdatedAt":null}