{"chapters":[],"id":66,"path":"27541-my-dungeon-life-rise-of-the-slave-harem","pluginId":"scribblehub","name":"My Dungeon Life: Rise of the Slave Harem","cover":"https://cdn.scribblehub.com/images/1/my-dungeon-life-rise-of-the-slave-harem_27541_1618347275.jpg","summary":"Summary: \nDeek has never had success with the ladies. He’s poor, overweight, and generally unliked. Feeling like a burden on his mother, with his life going nowhere, he spends his days playing video games. However, when a mysterious game ends up in his bag, he is teleported to another world. The only way for a talentless slob like him to get by is to venture into dangerous dungeons for fame and money. Regrettably, Deek always preferred to play support roles, and in this case he picked White Mage. In a world with slavery, where he can purchase beautiful and powerful women as his allies, this might actually work.\nTags: Isekai, Slice-of-life, RPG, Weak-Protagonist, Comedy, Harem, Large-Harem, Slavery, Romance, Animalgirls, Monstergirls, Dungeons, Drama, Erotica, Growing-protagonist\nThis is a slow-burning story with small chapters that are released daily. It is a wish-fulfillment story with over 1000 chapters, and 16 volumes and counting. The story has a strong worldbuilding element and characterization, but this takes a long time to develop. This is not a story where everyone gets their arc by the end of Volume 1. As for sex scenes, there are no rapes scenes. The women are usually the aggressors. They are also 100% optional/skippable and detached from the main story. The entire story is available on my website whatsawhizzerwebnovels.com. Members get access to every chapter, including images. This include portraits of every girl, erotica from every scene, and other art. It is also sold on Amazon.\n","author":"whatsawhizzer","artist":"","status":"Ongoing","genres":"Adult,Adventure,Ecchi,Fantasy,Harem,Isekai,LitRPG,Slice of Life","inLibrary":1,"isLocal":0,"totalPages":0,"chaptersDownloaded":0,"chaptersUnread":0,"totalChapters":0,"lastReadAt":null,"lastUpdatedAt":null}