{"chapters":[],"id":71,"path":"416954-damien-nightshade-the-villainous-vampire","pluginId":"scribblehub","name":"Damien Nightshade The Villainous Vampire","cover":"https://cdn.scribblehub.com/images/20/damien-nightshade-the-villainous-vampire_416954_1659038220.jpg","summary":"Vampires are creatures of the night that fulfil their desires from dusk till dawn. Inhabiting the dark caves of the Kazimir mountains, the other races mostly disregard the unintelligent bloodthirsty creatures. \nDamien Nightshade, third in line to the vampire throne, a descendant of an S rank existence, is ostracized by his siblings and forced to leave the comfort of the caves. How will this germaphobic, lazy, bloodthirsty vampire fit within the human realm?\nThis is Damien's dilemma as he finds himself transmigrated as a vampire inside a familiar room, one belonging to a Villain in the popular VR game \"Throne and Awakening\". \nDamien considers himself a veteran of the game; he knew the game's storyline better than anyone with five years of experience and thousands of hours. Yet the internet wouldn't agree with him. A true veteran must complete the game as the character \"Damien Nightshade\", the vampire prince hated by all living existences. \nAfter five failed attempts, Damien still has never completed the storyline while playing this character. Will Damien be able to survive this time with knowledge of future events? But he will have to adapt quickly as the world's rules have changed, as it becomes more than just a simple game. \nBut first, maybe he should deal with his maid, who silently plots his murder while he sleeps.\nRead chapters ahead: https://www.patreon.com/xkarnation\n----------------------\nThis tale is set in a magical world with a heavy emphasises on Kingdom Building, Twisted Nobles, and Gruelling Politics with sprinkles of Magic, Mystery, and the occasional Action Scene. Throne and Awakening is a world packed with danger around every corner, join Damien as he attempts to navigate this terrifying world with knowledge he should not possess and atypical powers that have no business belonging to a Vampire.\n","author":"XKARNATION","artist":"","status":"Ongoing","genres":"Action,Adventure,Fantasy,Isekai,LitRPG,Mature,Psychological,Romance,Seinen","inLibrary":1,"isLocal":0,"totalPages":0,"chaptersDownloaded":0,"chaptersUnread":0,"totalChapters":0,"lastReadAt":null,"lastUpdatedAt":null}