{"chapters":[],"id":74,"path":"86894-dungeons-path","pluginId":"scribblehub","name":"Dungeon’s Path","cover":"https://cdn.scribblehub.com/images/4/dungeons-path_86894_1580314777.jpg","summary":"The only places I have posted the story and allow it to exist are on RoyalRoad, Scribblehub, and my Patreon.\nSo the world ended. Whoopsie? We didn’t even see it coming. Quite literally as it came at us faster than the speed of light. Don’t worry though, it got better. Also, I am not joking about the world ending. Most people say that and mean humans are inconvenienced for some reason. Nope, all matter disintegrated at the atomic scale there for a few moments. Apparently the local universe wasn’t actually stable? Don’t ask me to go into too much detail. It would require both of us to have a few more college degrees than sense and I at least lack them (both the degrees and the sense). Anyway, the energy/matter/wibbly wobbly strings were at a local minimum and not the universal minimum. Basically, what we took for sea level was actually a nice little mountain lake and when the dam busted so did, well, everything.\nNow here is where things go a bit off track with what normal meant before. You see magic is real, qi is real, gods are real. Not on old Earth mind you but souls don’t pay much attention to time and space so we dreamed of it. In fact, the closer the shift in reality got to Earth the closer our dreams got to the new reality. This is basically me tip toeing around the fact that it was a ‘System Apocalypse’. Reality became a video game, I became a dungeon, and this is my story.\n-----\nDoyle Huxley just wanted a normal life but as the above might clue you in on that just isn’t in the cards. He gets to experience a “Path Based System Apocalypse” and some early paths he takes, both literally and figuratively, lead to him becoming a dungeon.\nThe aim is to release chapters once a week on Friday\nCursing will be avoided and no naughty adult action will take place in the story.\n","author":"Akhier","artist":"","status":"Ongoing","genres":"Action,Adventure,Fantasy,LitRPG,Sci-fi,Slice of Life,Supernatural","inLibrary":1,"isLocal":0,"totalPages":0,"chaptersDownloaded":0,"chaptersUnread":0,"totalChapters":0,"lastReadAt":null,"lastUpdatedAt":null}