{"chapters":[],"id":75,"path":"287182-the-king-of-fairies-is-now-a-demon-lord","pluginId":"scribblehub","name":"The King of Fairies is now a Demon Lord","cover":"https://cdn.scribblehub.com/images/14/the-king-of-fairies-is-now-a-demon-lord_287182_1627684754.jpg","summary":"Drifting across the abyss was the soul of a celestial. \nImmensely loved by the universe yet bound by the chains of nihility, he was never able to leave his ruling realm due to constraints.\nTime passed, moments became days, days became years and years became eons. \nDid he even exist? He didn\\'t know the answer to that. \nSuddenly a bright light apeared in the abysmal darkness, he was overjoyed thinking that he might not have been alone. \nTo his dismay, it was not another residue soul but instead a single page with letters incomprehensible. \nUpon reading the page, great pain struck his astral self shattering it and merging with the page. The pain was so great that he lost consciousness. \nUpon waking up, he noticed he was no longer in the void.\n~\nIn his first life he was the King of Fairies, in his second life he was a normal human in a parallel world.\nHis arrogance and narcissism had toned down quite a bit due to becoming a powerless being.\nStill he didn\\'t give up hope!\nHe was finally able to become a world renowned pianist.\nAnd a secret doctor in the underword, using his expert acupuncture techniques.\nMany thought that he was a chunnibyo because of how he talked, he ignored them all.\nMany women threw themselves at him, but he rejected them all.\nEven though he had become human he refused to even look at a human girl.\nUgly! That\\'s how they looked to him.\nHim, who had seen world shaking beauties couldn\\'t even bare to look at human women.\nHence many people thought he was gay and sent gay people to him to gain curry with him.\nResult?\nHe killed the bastards!\nIn the end, his second life was like a joke.\nChoking on cup noodles his life came at an abrupt end.\nBut the end is a start of another beginning.\nAnd this beginning would be the best one ever.\n...\n..\n.\nOne thing is certain, beauties from all the realms, be it the Celestial or the Godly! All would fall in love with him! The Almighty Stepfather!\n~\nThis is a light read, not comedy nor too serious.\n~\n*= Light Smut.\n**= Heavy smut.\n~\nhttps://discord.gg/JertH4aQJw\n","author":"Oink","artist":"","status":"Ongoing","genres":"Action,Adult,Adventure,Comedy,Ecchi,Fantasy,Harem,Romance,Smut","inLibrary":1,"isLocal":0,"totalPages":0,"chaptersDownloaded":0,"chaptersUnread":0,"totalChapters":0,"lastReadAt":null,"lastUpdatedAt":null}