{"chapters":[],"id":81,"path":"524948-after-the-end-serenity","pluginId":"scribblehub","name":"After the End: Serenity","cover":"https://cdn.scribblehub.com/images/26/After-the-End-Serenity_524948_1657406836.jpg","summary":"We all want to believe we are heroes of our own story - unless we want to be the villain, of course.\nAt the end of everything, the Final Reaper decided he hadn’t been a hero. Driven by a desire to right the wrongs he was subjected to, he killed everyone who wronged him or his people - which turned out to be everyone that wasn’t killed by someone else first. He'd won - but it was a hollow victory.\nEventually, Order’s Voice found a way out. If the only existing being would agree to give up most of his power, the Voice could reset the multiverse to an earlier time with a few minor changes. Of course, the Voice couldn't ask it that way. It could only ask if the Final Reaper was willing to start over from when Earth was first brought into Order.\nIt was an easy decision, and yet it wasn’t. Was he willing to go through eons of pain again to not be alone?\nYes. In a heartbeat.\nNot that his heart beat anymore. Now it would. Perhaps he could even be a hero, this time.\nWhen he landed in his old body - more or less - on Earth, the Final Reaper once again became Thomas. He was both and neither. He needed a new name for a new life.\nSerenity.\n------------------------------------------\nWhile this is technically a System Apocalypse story, it's a System Apocalypse that is designed to have a large percentage of the population survive and prosper. There are a lot of problems that come with the appearance of the Voice, and it's entirely possible to lose. Earth has some special opportunities, but also special challenges.\nThe first time around, Earth won the first round and lost the second. Serenity has ten years from when the Voice arrives to prevent that from happening. It will be a group effort; Serenity can't win alone - which is difficult for someone who's been alone for as long as he has.\nOf course, that's only his second priority.\n-------------------------------------------\nUpdates Twice a Day until we catch up with RoyalRoad\nMore chapters are available on RoyalRoad: https://www.royalroad.com/fiction/44593/after-the-end-serenity\nIf that's not enough, check out my Patreon: https://www.patreon.com/user?u=61140045\nA note on the nonhuman lead tag: He isn't human, and hasn't been human for a very, very long time (or maybe not long at all, depending on how you count it). He still thinks of himself as human, either way.\nThe content warnings are mostly to give me room to write; this fiction is not intended to be edgy, but once in a while a character will swear or someone will get seriously injured.\nThe cover image is a Chandra/Hubble composite image of VV 340 / Arp 302 / UGC 9618. While we're not going to space itself any time soon in the story, people from elsewhere are coming to Earth and Serenity will visit other planets. Plus, I like space imagery.\n","author":"Lillene","artist":"","status":"Ongoing","genres":"Adventure,Fantasy,LitRPG","inLibrary":1,"isLocal":0,"totalPages":0,"chaptersDownloaded":0,"chaptersUnread":0,"totalChapters":0,"lastReadAt":null,"lastUpdatedAt":null}