{"chapters":[],"id":83,"path":"52931-rupegia","pluginId":"scribblehub","name":"Rupegia","cover":"https://cdn.scribblehub.com/images/2/rupegia_52931_1574107706.jpg","summary":"\"You may now kiss the bride.\"\nBut no kiss ever came.\nI'm ripped from my wedding and thrown into a medieval fantasy world with game-like elements. It may seem like a game, but that doesn't matter to me, because this is my reality. The pain, the hunger, the cold, the fear, it's all real to me.\nAlone, without knowing why I'm here, in a world where I know nothing and nobody, I decide to buy a Blood Slave to have someone I can trust. She brings me comfort and so much more. She helps me raise my head high again and bravely move forward. Together, we'll grow stronger. Together, we're unbreakable. But she won't be the only one by my side. We need more than just each other, for I know that my purpose in this world can't be accomplished with only her help.\nMonsters and dungeons plague the land, forcing civilization to protect themselves from the hordes with tall walls and fierce determination. Killing monsters is a daily need, but they aren't the only enemy here. I have a powerful \"Gift\" that allows me to change my \"skill points\" at will, but if others were to know about it, there would be many that would try to use me by any means possible.\nStep by step, moment by moment, day by day, we keep moving forward, always aiming to improve our strength. One day, we'll meet our Fate, and we'll be ready for it. Swords held high, shields tightly strapped to our arms, wings spread apart, spells at the tip of our tongues, minds focused like blades, and our hearts hardened like steel. We'll take on whatever comes our way!\n---------------------------------------------\n**New chapters Monday, Wednesday, and Friday at 8PM US East. At least 3k words each.**\n*Additional Tags*: Psychological, Romance, Magic, Male Lead, Portal Fantasy/Isekai/Transmigration, Polygamy, Slaves\n*Content Warning*: gore, profanity, sexual content (male/female, female/female, and human/non-human (*not for the faint of heart*)), traumatizing content\n*What to expect*: Slow story focused on the day-to-day life of a transmigrated man rather than on the plot.\nThe plot exists but it *very slowly* becomes relevant.\nAlso, *slow* character progress. It's a long journey, so don't expect a hero to grow in just a few chapters.\nDetailed environments and extensive world-building.\nRealistic and tactical combat instead of flashy.\nProtagonist with a cheat but far from overpowered.\n*Lots* of descriptive sex scenes, it is treated as just another part of life instead of merely fan-service.\nA harem where the members actually enjoy living with each other.\nOccasional weird wording and grammar, English isn't my first language.\nThis story is also on Royal Road (*most of the sexual content is censored*), Novel Updates, Hentai Foundry, Webnovel, MoonQuill, Archive of Our Own, and Literotica.\n","author":"Manasong","artist":"","status":"Ongoing","genres":"Action,Fantasy,Harem,Isekai,LitRPG,Mature,Romance,Slice of Life,Smut","inLibrary":1,"isLocal":0,"totalPages":0,"chaptersDownloaded":0,"chaptersUnread":0,"totalChapters":0,"lastReadAt":null,"lastUpdatedAt":null}